{
  "PersonalInformation": {
    "name": "DUONG PHUC HAU",
    "phone": "0877757745",
    "email": "phuchau162@gmail.com"
  },
  "Degree": ["Major: Software Development - FPT POLYTECHNIC - GPA: 8.3/10 - AUG 2019- DECEMBER 2022"],
  "Experience": ["Internship 5/2022 - 8/2022 - Making in SmartPay is an electronic wallet product - Training and using technology at SmartPay - Technology: Microservice, Java Servlet/Jetty, Rabbit MQ, Kafka, Redis, MongoDB, MySQL, CI/CD", "Project in freelance - Repair service", "Class management software", "Personal Project - Account management"],
  "TechnicalSkills": ["JAVA", "OOP", "Spring Boot Framework", "NodeJS", "HTML", "CSS", "JavaScript", "ReactJS", "Bootstrap", "AngularJS", "SQL Server", "My SQL", "MongoDB", "Redis", "Intellij", "Eclipse", "Visual Studio Code", "Git"],
  "Responsibilities": ["Technology: Java spring boot, SQL Server, Jpa, REST API, Angularjs - Function: Login(Uesr, Google), Decentralize(Security), Forgot password(Send Email), Cart(Angular API) Admin: Chart statistics(money(month, year), Number of orders(day, month), Account management User: Add orders, pay, See the product"],
  "Certificates": [],
  "SoftSkills": ["Ability to work in a team", "Good communication skills"],
  "Comment": "The candidate has a strong background in Java and programming, with experience in back-end and front-end technologies. They have completed a software development major with a GPA of 8.3/10. The candidate has also gained practical experience through an internship at SmartPay, where they worked on an electronic wallet product using Java and various technologies. They have also worked on freelance projects and personal projects, demonstrating their ability to work independently. The candidate possesses a wide range of technical skills and is proficient in tools such as Intellij, Eclipse, and Visual Studio Code. They also have experience with databases such as SQL Server, MySQL, and MongoDB. In terms of soft skills, the candidate has the ability to work in a team and communicate effectively.",
  "JobRecommend": ["Back-End Developer", "Front-End Developer", "Full Stack Developer"]
}